mediaMicroservices/wrk2/results/2phones/2phones_60s_r50.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 222.054ms, rate sampling interval: 926ms
  Thread calibration: mean lat.: 175.713ms, rate sampling interval: 574ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   232.17ms  243.32ms   1.25s    90.74%
    Req/Sec    24.29      5.90    38.00     75.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  152.06ms
 75.000%  251.90ms
 90.000%  454.14ms
 99.000%    1.25s 
 99.900%    2.21s 
 99.990%    2.23s 
 99.999%    2.23s 
100.000%    2.23s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      54.303     0.000000            1         1.00
      82.495     0.100000          251         1.11
      95.039     0.200000          496         1.25
     110.527     0.300000          743         1.43
     128.511     0.400000          991         1.67
     152.063     0.500000         1238         2.00
     166.271     0.550000         1361         2.22
     183.423     0.600000         1485         2.50
     203.007     0.650000         1608         2.86
     225.407     0.700000         1732         3.33
     251.903     0.750000         1855         4.00
     268.031     0.775000         1919         4.44
     284.671     0.800000         1980         5.00
     317.183     0.825000         2042         5.71
     348.927     0.850000         2103         6.67
     398.335     0.875000         2164         8.00
     423.935     0.887500         2195         8.89
     454.143     0.900000         2226        10.00
     491.263     0.912500         2257        11.43
     551.423     0.925000         2289        13.33
     632.831     0.937500         2319        16.00
     676.351     0.943750         2334        17.78
     718.335     0.950000         2350        20.00
     760.831     0.956250         2365        22.86
     797.183     0.962500         2381        26.67
     836.607     0.968750         2396        32.00
     884.735     0.971875         2404        35.56
     915.455     0.975000         2412        40.00
     973.823     0.978125         2419        45.71
    1021.951     0.981250         2427        53.33
    1127.423     0.984375         2435        64.00
    1154.047     0.985938         2439        71.11
    1208.319     0.987500         2443        80.00
    1236.991     0.989062         2446        91.43
    1274.879     0.990625         2450       106.67
    1428.479     0.992188         2454       128.00
    1482.751     0.992969         2456       142.22
    1553.407     0.993750         2458       160.00
    1717.247     0.994531         2460       182.86
    1765.375     0.995313         2462       213.33
    1895.423     0.996094         2464       256.00
    1933.311     0.996484         2465       284.44
    1936.383     0.996875         2466       320.00
    2021.375     0.997266         2467       365.71
    2073.599     0.997656         2468       426.67
    2081.791     0.998047         2469       512.00
    2081.791     0.998242         2469       568.89
    2113.535     0.998437         2470       640.00
    2113.535     0.998633         2470       731.43
    2211.839     0.998828         2471       853.33
    2211.839     0.999023         2471      1024.00
    2211.839     0.999121         2471      1137.78
    2228.223     0.999219         2473      1280.00
    2228.223     1.000000         2473          inf
#[Mean    =      232.172, StdDeviation   =      243.325]
#[Max     =     2226.176, Total count    =         2473]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2992 requests in 1.00m, 537.62KB read
Requests/sec:     49.86
Transfer/sec:      8.96KB